#------------------------------------------------
# See: https://github.com/Homebrew/homebrew-bundle
#
# Steps:
#     touch Brewfile
#     brew bundle
# 
# Remember that you can 'require' a Brewfile inside another brewfile!
#
#------------------------------------------------
require Brewfile.base
require Brewfile.dev
require Brewfile.design
require Brewfile.biz

# Get all taps first
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# Dev
tap "sensu/tap"
# tap "tokutek/tokumx"
# Development related, for example with Git
brew "git"
brew "bfg"
brew "git-annex"
brew "git-archive-all"
brew "git-crypt"
brew "git-extras"
brew "git-flow"
brew "git-ftp"
brew "git-lfs"
brew "git-utils", args: ["HEAD"]
cask "diffmerge"
cask "rowanj-gitx"


# Wordpress
tap "wpengine/wpe-cli"
cask "wordpresscom"
brew "wpengine/wpe-cli/wpe-cli"

#--------------------------------------------------
# Cloud Systems
#--------------------------------------------------
# Aws
tap "aws/tap"
brew "aws-cfn-tools"
brew "aws-elasticbeanstalk"
brew "awscli"
brew "awslogs"

# Azure
brew "azure-cli"
#--------------------------------------------------
# /End cloud Systems
#--------------------------------------------------


# Programming Languages
tap "josegonzalez/php"
tap "dart-lang/dart"
tap "fabsb/flutter"
brew "python", link: false
brew "gcc"
brew "go"
cask "flutter"
brew "node", link: false
# brew "node@10"
# brew "node@8", link: true
cask "touchdesigner"
cask "visual-studio-code"
cask "xoctave"
brew "composer"
brew "erlang"
brew "brew-php-switcher"
brew "php", link: false
brew "exolnet/deprecated/php@5.6", link: true
brew "kotlin"
cask "android-sdk"

# Systems Setup 
tap "denji/nginx"
# tap "exolnet/deprecated"

# Basics, libraries and dependencies
brew "freetype"
brew "openssl@1.1"
brew "the_silver_searcher"

# Systems Tools
cask "tunnelblick"
cask "vagrant"
cask "vagrant-manager"
cask "virtualbox"
brew "docker", link: false
brew "docker-machine"


# Core libraries and dependencies
brew "jpeg"
brew "icu4c"
brew "librsvg"
brew "aircrack-ng"
brew "apachetop"
brew "app-engine-python"
brew "apr"
brew "apr-util"
brew "argp-standalone"
brew "argtable"
brew "gmp"
brew "mpfr"
brew "libmpc"
brew "open-mpi"
brew "openblas"
brew "atomicparsley"
# brew "auto-scaling"
brew "autoconf"
brew "automake"
brew "autossh"
brew "bar"
brew "base64"
brew "bison@2.7"
brew "boost"
brew "boost-build"
brew "boost-python"
brew "cairomm"
brew "cdpr"
brew "cmake"
# brew "chromedriver"
brew "cloc"
brew "rlwrap"
brew "clojure"
brew "cloog"
brew "cloud-watch"
brew "clucene"
brew "cmu-sphinxbase"
brew "cocoapods", link: false
brew "coreutils"
brew "curl"
brew "libssh2"
brew "dcraw"
brew "ddrescue"
brew "doctl"
brew "dos2unix"
brew "doxygen"
brew "dpkg"
brew "ec2-ami-tools"
brew "elasticsearch"
brew "elb-tools"
brew "elinks"
brew "popt"
brew "ghostscript"
brew "exempi"
brew "exiftool"
brew "libexif"
brew "exiftran"
brew "exiv2"
brew "expat"
brew "f3"
brew "faad2"
brew "fcgi"
brew "fdk-aac"
brew "libidn2"
brew "theora"
brew "ffmpeg"
brew "fftw"
brew "findutils"
brew "flex"
brew "fping"
brew "gawk"
brew "gd"
brew "hdf5"
brew "libxml2"
brew "libpq"
brew "netcdf"
brew "gdal"
brew "gdb"
brew "geckodriver"
brew "getmail"
brew "libgpg-error"
brew "gsasl"
brew "gtk+3"
brew "lua@5.1"
brew "inettools"
brew "py3cairo"
brew "pygobject3"
brew "quvi"
brew "glfw"
brew "gnome-common"
brew "libksba"
brew "npth"
brew "pinentry"
brew "google-sparsehash"
brew "gpgme"
brew "libusb-compat"
brew "libgphoto2"
brew "gphoto2"
brew "gradle"
brew "graphicsmagick"
brew "gts"
brew "hexedit"
brew "html-xml-utils"
brew "htop"
brew "httpd"
brew "httpie"
brew "id3tool"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "iftop"
brew "imagemagick", link: false
brew "imagemagick@6", link: true
brew "intltool"
brew "ios-deploy"
brew "iperf3"
# brew "isl@0.12"
brew "jbig2dec"
brew "jq"
brew "jsonpp"
# brew "leafnode"
brew "leiningen"
brew "libao"
brew "libav"
# brew "libdnet", args: ["with-python"]
brew "libiptcdata"
brew "liblwgeom"
brew "libpst"
brew "libsigc++"
brew "libsvg"
brew "libsvg-cairo"
# brew "libusbmuxd", args: ["HEAD"]
brew "libvo-aacenc"
brew "libwmf"
brew "libxslt"
brew "libyaml"
brew "little-cms"
brew "lsusb"
brew "lz4"
brew "lzip"
brew "lzlib"
brew "macvim"
brew "mad"
brew "makedepend"
brew "postgresql", restart_service: true
brew "python@2"
brew "mapnik"
brew "markdown"
brew "media-info"
brew "memcache-top"
brew "memcached"
brew "mercurial"
brew "mlt"
brew "mmv"
# brew "mplayer"
brew "mysql", restart_service: true
brew "mysql-client"
# brew "mysql-utilities"
brew "mysql@5.7"
brew "nailgun"
brew "ncftp"
brew "neo4j"
brew "neon"
brew "nmap"
brew "nodeenv"
brew "normalize"
brew "ocaml"
brew "portaudio"
brew "octave"
brew "ola"
brew "opencv"
brew "optipng"
brew "osm-pbf"
brew "osm2pgsql", args: ["HEAD"]
brew "osmosis"
brew "p7zip"
brew "packer"
brew "pdfgrep"
brew "pg_top"
brew "pidof"
brew "platformio"
brew "png2ico"
brew "pngcrush"
brew "pngquant"
brew "postgis"
brew "postgresql@10"
brew "ppl"
brew "pssh"
brew "pth"
brew "pup"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pyenv-virtualenvwrapper"
# brew "pygobject"
brew "pypy3"
brew "pyqt"
brew "python@3.8"
brew "qpdf"
# brew "qtfaststart"
brew "r"
brew "rabbitmq"
brew "rabbitmq-c"
brew "rds-command-line-tools"
brew "re2c"
brew "redis"
brew "rename"
brew "renameutils"
brew "repo"
brew "rhino"
brew "rsnapshot"
brew "rsync"
brew "rustup-init"
brew "s3cmd"
brew "sbt"
brew "scala"
brew "scons"
brew "selenium-server-standalone"
brew "serf"
brew "shapelib"
brew "siege"
brew "simple-amqp-client", link: false
# brew "skipfish"
brew "sloccount"
brew "sntop"
brew "solr"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "utf8proc"
brew "subversion"
brew "supervisor"
brew "svg2png"
brew "swig"
brew "taglib"
brew "tcpflow"
brew "telnet"
brew "texi2html"
brew "the_silver_searcher"
brew "tig"
brew "timelimit"
brew "tmux-xpanes"
brew "tor"
brew "tree"
brew "unison"
brew "unrar"
brew "vim", link: false
brew "vips"
brew "wakeonlan"
brew "watchman"
brew "webalizer"
brew "wget"
brew "wireguard-tools"
brew "wp-cli"
brew "wp-cli-completion"
# brew "xctool"
brew "yajl"
brew "yaml-cpp"
brew "yasm"
brew "zlib"
brew "aws/tap/aws-sam-cli"
brew "dart-lang/dart/dart"
brew "denji/nginx/ngx-devel-kit"
brew "denji/nginx/lua-nginx-module"
brew "denji/nginx/nginx-full", args: ["with-geoip", "with-image-filter", "with-lua-module"]


cask "xquartz"
cask "ableton-live-suite"
# cask "acquia-dev-desktop"
cask "anaconda"
cask "angry-ip-scanner"
cask "arduino"
cask "atom"
cask "blender"
cask "commander-one"
cask "cycling74-max"
cask "digikam"
cask "displaylink"
cask "docker"
cask "dotnet-sdk"
cask "electron"
cask "emclient"
cask "expressvpn"
cask "fing"
cask "firefox"
cask "fritzing"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-web-designer"
cask "grandperspective"
cask "gulp"
cask "hugin"
cask "imageoptim"
cask "inkscape"
cask "intel-haxm"
cask "istumbler"
cask "java"
cask "julia"
cask "librecad"
cask "libreoffice"
cask "mplayer-osx-extended"
cask "mysqlworkbench"
cask "packetsender"
cask "postman"
cask "processing"
cask "projectlibre"
cask "pycharm-ce"
cask "sequel-pro-nightly"
cask "shimo"
cask "silicon-labs-vcp-driver"
cask "sketch"
cask "sketch-toolbox"
cask "skype"
cask "sonos"
cask "sourcetree"
cask "tableplus"
cask "teamviewer"
cask "thunderbird"
cask "toggl"

cask "wkhtmltopdf"
cask "zerotier-one"
cask "find-any-file"


# For machine-learning stuff
brew "jupyterlab"
cask "nvidia-cuda"

# Sysops
brew "iperf3"
